[
    {
        "title": "Multichannel Sensor Analysis for Fall Detection: Evaluating Accelerometer, Gyroscope, and Magnetometer Data in Real-World Settings",
        "year": "2025",
        "url": "N/A",
        "image": "/images/timeseries-final-boxplot.png",
        "description": "Processed wearable sensor data (accelerometer, gyroscope, magnetometer) for fall detection analysis.\nDeveloped and compared tabular vs. time-series machine learning models using Scikit-learn and Aeon.\nIdentified acceleration-only models as most effective (F1 = 0.99, AUC = 1.0)\nHighlighted an efficient, interpretable approach for real-world fall detection"
    },
    {
        "title": "Pizza Perplexion Data Visualization",
        "year": "2025",
        "url": "N/A",
        "image": "/images/pizza-perplexion.png",
        "description": "Visualizing trends from a grocery store dataset. I found that Whole Foods pizzas are more expensive yet not healthier than pizzas from Walmart and Target."
    },
    {
        "title": "Predicting Recipe Health Final Project",
        "year": "2025",
        "url": "N/A",
        "image": "/images/recipe-health.png",
        "description": "Built a supervised ML pipeline in Scikit-learn to classify recipe healthiness using ingredient data. Cleaned and preprocessed text-based ingredients, engineered features like ingredient count and binary indicators. Improved F1 score from 0.67 to 0.77 through cross-validation and hyperparameter tuning. Published report and visualizations on GitHub Pages using Jupyter Notebook and Markdown"
    },
    {
        "title": "Is Abortion Access a Partisan Issue?",
        "year": "2025",
        "url": "N/A",
        "image": "/images/dsc106-project2.png",
        "description": "For this project we made two propositions and created visualizations to support both sides, showing how the same data can be manipulated to fit different narratives. Our proposition is that Women living in red states have less access to abortion and travel out-of-state at a higher rate to receive abortions"
    },
    {
        "title": "Analyzing the Relationship Between Environmental Threats and Global Health",
        "year": "2025",
        "url": "N/A",
        "image": "/images/cogs108-project.png",
        "description": "Climate change and pollution represent some of the most urgent threats to human health and the planet's future. While these environmental issues are known to impact daily life, analyzing their direct relationship with common health conditions reveals just how deeply intertwined they are with public well-being. Gaining a clearer understanding of these connections is essential for preparing for future global health challenges. This project explored the relationship between environmental threats—specifically air pollution and climate change—and health outcomes, focusing on respiratory infectious diseases. By integrating data from global air pollution, health statistics, and climate change datasets, we developed a consilidated resource for analysis."
    },
    {
        "title": "Bikewatching: Boston",
        "year": "2025",
        "url": "https://m1chun.github.io/bikewatching/",
        "image": "/images/bikewatching.png",
        "description": "This project explores bike activity in Boston and Cambridge Massachusetts throughout the day. In the morning there are many bikes arriving. The number of bikes balances out throughout the day and at night more bikes are departing."
    },
    {
        "title": "DSC 30 Final Project",
        "year": "2024",
        "url": "N/A",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Iste quod aspernatur, nam esse rerum non totam dolores sint natus dolorem aut sapiente, maiores quo pariatur alias. Asperiores praesentium obcaecati aliquid impedit aut illum reprehenderit veniam vero quo ea?"
    },
    {
        "title": "DSC 10 Final Project",
        "year": "2023",
        "url": "N/A",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Odio minima autem omnis temporibus, incidunt est. Minus corrupti quaerat repellat sed harum hic laudantium quas similique delectus accusamus, quos laboriosam ea suscipit temporibus? Distinctio minima facere eveniet aperiam voluptatibus?"
    },
    {
        "title": "COGS 9 Final Project",
        "year": "2024",
        "url": "N/A",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Rerum velit blanditiis aliquam vel excepturi id provident aliquid eligendi accusamus? Iste veritatis iure odio, expedita nostrum deserunt amet laudantium, rem officia, qui tenetur explicabo facere? Dignissimos in necessitatibus aspernatur."
    },
    {
        "title": "American Association of Statistics Poster Challenge",
        "year": "2023",
        "url": "N/A",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Dolorem nisi repellat, molestiae vel at dolore iure neque ratione qui eaque dignissimos ab dolores perspiciatis corporis cum, autem aliquid! Ab illo laboriosam, vero ex aspernatur consequuntur. Ab, sed impedit!"
    },
    {
        "title": "DSC 40A Project",
        "year": "2024",
        "url": "N/A",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A odit ut perspiciatis, libero aperiam inventore iste dignissimos enim commodi nemo nesciunt at ipsum tempore maxime molestiae natus consectetur iusto eum ratione iure atque nam! Voluptatum doloremque cupiditate neque?"
    },
    {
        "title": "DSC 40B Project",
        "year": "2025",
        "url": "N/A",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Repudiandae magni pariatur suscipit corporis iusto debitis, deserunt quae amet obcaecati a. Neque ea reiciendis officiis sapiente, quas atque tempora tenetur quisquam culpa harum beatae accusamus enim quis voluptatum vero."
    }
]